In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv("Data/TrainDataAnalysis.csv")

In [3]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group,Fare_group
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,"[20, 40)","[0, 7.9)"
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,"[20, 40)",[38.9+)
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"[20, 40)","[7.9, 14.4)"
3,1,1,female,35.0,1,0,113803,53.1000,C123,S,"[20, 40)",[38.9+)
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S,"[20, 40)","[7.9, 14.4)"

In [4]:
df = df.drop(['Ticket'], axis = 1)

In [5]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Age_group,Fare_group
0,0,3,male,22.0,1,0,7.2500,NaN,S,"[20, 40)","[0, 7.9)"
1,1,1,female,38.0,1,0,71.2833,C85,C,"[20, 40)",[38.9+)
2,1,3,female,26.0,0,0,7.9250,NaN,S,"[20, 40)","[7.9, 14.4)"
3,1,1,female,35.0,1,0,53.1000,C123,S,"[20, 40)",[38.9+)
4,0,3,male,35.0,0,0,8.0500,NaN,S,"[20, 40)","[7.9, 14.4)"

In [6]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [7]:
df['Cabin_New'] = df['Cabin'].apply(lambda x: 
                     list(x) if type(x) != float else 
                     np.nan
                )

In [8]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Age_group,Fare_group,Cabin_New
0,0,3,male,22.0,1,0,7.2500,NaN,S,"[20, 40)","[0, 7.9)",NaN
1,1,1,female,38.0,1,0,71.2833,C85,C,"[20, 40)",[38.9+),"[C, 8, 5]"
2,1,3,female,26.0,0,0,7.9250,NaN,S,"[20, 40)","[7.9, 14.4)",NaN
3,1,1,female,35.0,1,0,53.1000,C123,S,"[20, 40)",[38.9+),"[C, 1, 2, 3]"
4,0,3,male,35.0,0,0,8.0500,NaN,S,"[20, 40)","[7.9, 14.4)",NaN

In [9]:
df['Cabin_New_2'] = df['Cabin_New'].apply(lambda x: 
                         x[0] if type(x) == list else 
                         np.nan
                    )

In [10]:
df = df.drop(['Cabin', 'Cabin_New'], axis=1)

In [11]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Age_group,Fare_group,Cabin_New_2
0,0,3,male,22.0,1,0,7.2500,S,"[20, 40)","[0, 7.9)",NaN
1,1,1,female,38.0,1,0,71.2833,C,"[20, 40)",[38.9+),C
2,1,3,female,26.0,0,0,7.9250,S,"[20, 40)","[7.9, 14.4)",NaN
3,1,1,female,35.0,1,0,53.1000,S,"[20, 40)",[38.9+),C
4,0,3,male,35.0,0,0,8.0500,S,"[20, 40)","[7.9, 14.4)",NaN

In [12]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [13]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [14]:
df.isnull().sum()

Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
Age_group      177
Fare_group       0
Cabin_New_2    687
dtype: int64

In [15]:
df['Age_group'].fillna('[20, 40)', inplace=True)

In [16]:
df['Embarked'].fillna('S', inplace=True)

In [17]:
df['Cabin_New_2'].fillna('C', inplace=True)

In [18]:
df = df.drop(['Age'], axis=1)

In [19]:
df = df.drop(['Fare'], axis=1)

In [20]:
df['Sex_New'] = df['Sex'].apply(lambda x: 1 if x == 'male' else 0)

In [21]:
df.head()

,Survived,Pclass,Sex,SibSp,Parch,Embarked,Age_group,Fare_group,Cabin_New_2,Sex_New
0,0,3,male,1,0,S,"[20, 40)","[0, 7.9)",C,1
1,1,1,female,1,0,C,"[20, 40)",[38.9+),C,0
2,1,3,female,0,0,S,"[20, 40)","[7.9, 14.4)",C,0
3,1,1,female,1,0,S,"[20, 40)",[38.9+),C,0
4,0,3,male,0,0,S,"[20, 40)","[7.9, 14.4)",C,1

In [22]:
df = df.drop(['Sex'], axis=1)

In [23]:
class OneStepFeatEng():
    def __init__(self, df):
        self.df = df
        
    # Drop columns
    def drop_column(self, column_names):
        self.df.drop(column_names, axis=1, inplace=True)
        return self.df.head()
    
    ## Separated cols
    def separated_cols(self, target_var):
        target_var = target_var
        features = [x for x in list(self.df.columns) if x != target_var]
        
        cat_cols = [column_name for column_name in self.df.columns if self.df[column_name].dtypes=='O']
        num_cols = [column_name for column_name in self.df.columns if self.df[column_name].dtypes!='O']
        
        return features, cat_cols, num_cols
    
    # Boolean encoding
    def boolean_encoding(self, column_name, true_val):
        self.df[column_name] = self.df[column_name].apply(lambda x: 1 if x == true_val else 0)
        return self.df.head()
    
    # Final columns
    def final_columns(self):
        return self.df.columns
    
    # Final dataframe
    def final_dataframe(self):
        return self.df

In [24]:
X = OneStepFeatEng(df)

In [25]:
features, cat_cols, num_cols = X.separated_cols('Survived')

In [26]:
X.final_dataframe().head()

,Survived,Pclass,SibSp,Parch,Embarked,Age_group,Fare_group,Cabin_New_2,Sex_New
0,0,3,1,0,S,"[20, 40)","[0, 7.9)",C,1
1,1,1,1,0,C,"[20, 40)",[38.9+),C,0
2,1,3,0,0,S,"[20, 40)","[7.9, 14.4)",C,0
3,1,1,1,0,S,"[20, 40)",[38.9+),C,0
4,0,3,0,0,S,"[20, 40)","[7.9, 14.4)",C,1

In [27]:
features

['Pclass',
 'SibSp',
 'Parch',
 'Embarked',
 'Age_group',
 'Fare_group',
 'Cabin_New_2',
 'Sex_New']

In [28]:
cat_cols

['Embarked', 'Age_group', 'Fare_group', 'Cabin_New_2']

In [29]:
num_cols

['Survived', 'Pclass', 'SibSp', 'Parch', 'Sex_New']

In [30]:
X.final_dataframe().to_csv("Data/TrainFeatureEngined.csv", index=False)